{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "d09ac4f8",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "True"
      ]
     },
     "execution_count": 1,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import os\n",
    "from dotenv import load_dotenv\n",
    "\n",
    "load_dotenv()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "98459d99",
   "metadata": {},
   "outputs": [],
   "source": [
    "from langchain_neo4j import Neo4jGraph\n",
    "\n",
    "graph = Neo4jGraph(\n",
    "    url=os.getenv(\"NEO4J_URI\"),\n",
    "    username=os.getenv(\"NEO4J_USERNAME\"),  \n",
    "    password=os.getenv(\"NEO4J_PASSWORD\"),\n",
    ") "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "67941598",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'n': {'name': 'Hello AuraDB'}}]"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# 테스트 쿼리 실행 \n",
    "cypher_query = \"\"\"\n",
    "CREATE (n:Test {name: \"Hello AuraDB\"}) \n",
    "RETURN n\n",
    "\"\"\"\n",
    "\n",
    "graph.query(cypher_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "cdabaf79",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "데이터베이스가 초기화되었습니다.\n"
     ]
    }
   ],
   "source": [
    "def reset_database(graph):\n",
    "    \"\"\"\n",
    "    데이터베이스 초기화하기\n",
    "    \"\"\"\n",
    "    # 모든 노드와 관계 삭제\n",
    "    graph.query(\"MATCH (n) DETACH DELETE n\")\n",
    "    \n",
    "    # 모든 제약조건 삭제\n",
    "    constraints = graph.query(\"SHOW CONSTRAINTS\")\n",
    "    for constraint in constraints:\n",
    "        constraint_name = constraint.get(\"name\")\n",
    "        if constraint_name:\n",
    "            graph.query(f\"DROP CONSTRAINT {constraint_name}\")\n",
    "    \n",
    "    # 모든 인덱스 삭제\n",
    "    indexes = graph.query(\"SHOW INDEXES\")\n",
    "    for index in indexes:\n",
    "        index_name = index.get(\"name\")\n",
    "        index_type = index.get(\"type\")\n",
    "        if index_name and index_type != \"CONSTRAINT\":\n",
    "            graph.query(f\"DROP INDEX {index_name}\")\n",
    "    \n",
    "    print(\"데이터베이스가 초기화되었습니다.\")\n",
    "\n",
    "# 데이터베이스 초기화\n",
    "reset_database(graph)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "9f779b93",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# 데이터 모델 정의 \n",
    "cypher_query =  \"\"\"\n",
    "// Person 노드 생성\n",
    "CREATE (p1:Person {name: '홍길동', age: 35, city: '서울'})\n",
    "CREATE (p2:Person {name: '김철수', age: 28, city: '부산'})\n",
    "CREATE (p3:Person {name: '이영희', age: 32, city: '서울'})\n",
    "CREATE (p4:Person {name: '박지성', age: 40, city: '인천'})\n",
    "CREATE (p5:Person {name: '최민수', age: 45, city: '대전'})\n",
    "CREATE (p6:Person {name: '정소라', age: 29, city: '부산'})\n",
    "CREATE (p7:Person {name: '강대호', age: 33, city: '서울'})\n",
    "CREATE (p8:Person {name: '윤미래', age: 27, city: '대구'})\n",
    "\n",
    "// 관심분야 노드 생성\n",
    "CREATE (i1:Interest {name: '영화'})\n",
    "CREATE (i2:Interest {name: '음악'})\n",
    "CREATE (i3:Interest {name: '스포츠'})\n",
    "CREATE (i4:Interest {name: '요리'})\n",
    "CREATE (i5:Interest {name: '여행'})\n",
    "\n",
    "// 장소 노드 생성\n",
    "CREATE (l1:Location {name: '남산타워', city: '서울'})\n",
    "CREATE (l2:Location {name: '해운대', city: '부산'})\n",
    "CREATE (l3:Location {name: '경복궁', city: '서울'})\n",
    "CREATE (l4:Location {name: '월미도', city: '인천'})\n",
    "\n",
    "// KNOWS 관계 생성 (사람들 간의 친구 관계)\n",
    "CREATE (p1)-[:KNOWS {since: 2010}]->(p2)\n",
    "CREATE (p1)-[:KNOWS {since: 2015}]->(p3)\n",
    "CREATE (p1)-[:KNOWS {since: 2012}]->(p7)\n",
    "CREATE (p2)-[:KNOWS {since: 2018}]->(p6)\n",
    "CREATE (p3)-[:KNOWS {since: 2017}]->(p4)\n",
    "CREATE (p3)-[:KNOWS {since: 2020}]->(p5)\n",
    "CREATE (p4)-[:KNOWS {since: 2019}]->(p5)\n",
    "CREATE (p6)-[:KNOWS {since: 2016}]->(p8)\n",
    "CREATE (p7)-[:KNOWS {since: 2014}]->(p3)\n",
    "CREATE (p7)-[:KNOWS {since: 2021}]->(p8)\n",
    "\n",
    "// LIKES 관계 생성 (사람과 관심분야 간의 관계)\n",
    "CREATE (p1)-[:LIKES {rating: 5}]->(i1)\n",
    "CREATE (p1)-[:LIKES {rating: 4}]->(i5)\n",
    "CREATE (p2)-[:LIKES {rating: 5}]->(i3)\n",
    "CREATE (p3)-[:LIKES {rating: 4}]->(i2)\n",
    "CREATE (p3)-[:LIKES {rating: 5}]->(i4)\n",
    "CREATE (p4)-[:LIKES {rating: 5}]->(i3)\n",
    "CREATE (p5)-[:LIKES {rating: 3}]->(i1)\n",
    "CREATE (p5)-[:LIKES {rating: 4}]->(i5)\n",
    "CREATE (p6)-[:LIKES {rating: 5}]->(i2)\n",
    "CREATE (p7)-[:LIKES {rating: 4}]->(i4)\n",
    "CREATE (p8)-[:LIKES {rating: 4}]->(i5)\n",
    "\n",
    "// VISITED 관계 생성 (사람과 장소 간의 관계)\n",
    "CREATE (p1)-[:VISITED {date: '2022-03-15', rating: 4}]->(l1)\n",
    "CREATE (p1)-[:VISITED {date: '2022-05-20', rating: 5}]->(l2)\n",
    "CREATE (p2)-[:VISITED {date: '2022-04-10', rating: 3}]->(l2)\n",
    "CREATE (p3)-[:VISITED {date: '2022-06-05', rating: 5}]->(l3)\n",
    "CREATE (p4)-[:VISITED {date: '2022-07-12', rating: 4}]->(l4)\n",
    "CREATE (p4)-[:VISITED {date: '2022-02-28', rating: 5}]->(l1)\n",
    "CREATE (p5)-[:VISITED {date: '2022-08-03', rating: 4}]->(l3)\n",
    "CREATE (p6)-[:VISITED {date: '2022-01-17', rating: 5}]->(l2)\n",
    "CREATE (p7)-[:VISITED {date: '2022-09-22', rating: 3}]->(l1)\n",
    "CREATE (p8)-[:VISITED {date: '2022-10-08', rating: 4}]->(l2)\n",
    "\"\"\"\n",
    "\n",
    "graph.query(cypher_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "f39f5388",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'start': '홍길동', 'relationships': ['KNOWS(2010)'], 'end': '김철수'},\n",
       " {'start': '홍길동',\n",
       "  'relationships': ['KNOWS(2010)', 'KNOWS(2018)'],\n",
       "  'end': '정소라'},\n",
       " {'start': '홍길동',\n",
       "  'relationships': ['KNOWS(2010)', 'KNOWS(2018)', 'KNOWS(2016)'],\n",
       "  'end': '윤미래'},\n",
       " {'start': '홍길동', 'relationships': ['KNOWS(2015)'], 'end': '이영희'},\n",
       " {'start': '홍길동',\n",
       "  'relationships': ['KNOWS(2015)', 'KNOWS(2017)'],\n",
       "  'end': '박지성'},\n",
       " {'start': '홍길동',\n",
       "  'relationships': ['KNOWS(2015)', 'KNOWS(2017)', 'KNOWS(2019)'],\n",
       "  'end': '최민수'},\n",
       " {'start': '홍길동',\n",
       "  'relationships': ['KNOWS(2015)', 'KNOWS(2020)'],\n",
       "  'end': '최민수'},\n",
       " {'start': '홍길동', 'relationships': ['KNOWS(2012)'], 'end': '강대호'},\n",
       " {'start': '홍길동',\n",
       "  'relationships': ['KNOWS(2012)', 'KNOWS(2014)'],\n",
       "  'end': '이영희'},\n",
       " {'start': '홍길동',\n",
       "  'relationships': ['KNOWS(2012)', 'KNOWS(2014)', 'KNOWS(2017)'],\n",
       "  'end': '박지성'},\n",
       " {'start': '홍길동',\n",
       "  'relationships': ['KNOWS(2012)', 'KNOWS(2014)', 'KNOWS(2020)'],\n",
       "  'end': '최민수'},\n",
       " {'start': '홍길동',\n",
       "  'relationships': ['KNOWS(2012)', 'KNOWS(2021)'],\n",
       "  'end': '윤미래'}]"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher_query = \"\"\"\n",
    "MATCH (p1:Person{name:'홍길동'})-[r:KNOWS*1..3]->(p2:Person)\n",
    "RETURN p1.name AS start,[rel in r | type(rel) + '('+ rel.since + ')'] AS relationships, p2.name AS end\n",
    "\n",
    "\"\"\"\n",
    "graph.query(cypher_query)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "4a102886",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'start': '홍길동', 'end': '이영희'},\n",
       " {'start': '홍길동', 'end': '박지성'},\n",
       " {'start': '홍길동', 'end': '최민수'},\n",
       " {'start': '홍길동', 'end': '정소라'},\n",
       " {'start': '홍길동', 'end': '윤미래'}]"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher_query = \"\"\"\n",
    "MATCH (p1:Person{name:'홍길동'})-[r:KNOWS*2]->(p2:Person)\n",
    "RETURN p1.name AS start, p2.name AS end\n",
    "\n",
    "\"\"\"\n",
    "graph.query(cypher_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "538a7978",
   "metadata": {},
   "outputs": [
    {
     "ename": "SyntaxError",
     "evalue": "incomplete input (2383436071.py, line 1)",
     "output_type": "error",
     "traceback": [
      "  \u001b[36mCell\u001b[39m\u001b[36m \u001b[39m\u001b[32mIn[13]\u001b[39m\u001b[32m, line 1\u001b[39m\n\u001b[31m    \u001b[39m\u001b[31mcypher_query = \"\"\"\u001b[39m\n                   ^\n\u001b[31mSyntaxError\u001b[39m\u001b[31m:\u001b[39m incomplete input\n"
     ]
    }
   ],
   "source": [
    "cypher_query = \"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "391e293c",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'start': '홍길동', 'end': '김철수', 'degree': 1},\n",
       " {'start': '홍길동', 'end': '정소라', 'degree': 2},\n",
       " {'start': '홍길동', 'end': '윤미래', 'degree': 3},\n",
       " {'start': '홍길동', 'end': '이영희', 'degree': 1},\n",
       " {'start': '홍길동', 'end': '박지성', 'degree': 2},\n",
       " {'start': '홍길동', 'end': '최민수', 'degree': 3},\n",
       " {'start': '홍길동', 'end': '최민수', 'degree': 2},\n",
       " {'start': '홍길동', 'end': '강대호', 'degree': 1},\n",
       " {'start': '홍길동', 'end': '이영희', 'degree': 2},\n",
       " {'start': '홍길동', 'end': '박지성', 'degree': 3},\n",
       " {'start': '홍길동', 'end': '최민수', 'degree': 4},\n",
       " {'start': '홍길동', 'end': '최민수', 'degree': 3},\n",
       " {'start': '홍길동', 'end': '윤미래', 'degree': 2}]"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    },
    {
     "ename": "",
     "evalue": "",
     "output_type": "error",
     "traceback": [
      "\u001b[1;31m현재 셀 또는 이전 셀에서 코드를 실행하는 동안 Kernel이 충돌했습니다. \n",
      "\u001b[1;31m셀의 코드를 검토하여 가능한 오류 원인을 식별하세요. \n",
      "\u001b[1;31m자세한 내용을 보려면 <a href='https://aka.ms/vscodeJupyterKernelCrash'>여기</a>를 클릭하세요. \n",
      "\u001b[1;31m자세한 내용은 Jupyter <a href='command:jupyter.viewOutput'>로그</a>를 참조하세요."
     ]
    }
   ],
   "source": [
    "cypher_query = \"\"\"\n",
    "MATCH (p:Person{name: '홍길동'})-[r:KNOWS*]->(p2:Person)\n",
    "RETURN p.name AS start, p2.name AS end, SIZE(r) as degree\n",
    "\"\"\"\n",
    "graph.query(cypher_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "37f335d5",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'path': ['홍길동', '이영희', '최민수']}]"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#shortestPath 쿼리\n",
    "cypher_query = \"\"\"\n",
    "MATCH p=shortestPath((p1:Person{name:'홍길동'})-[:KNOWS*]-(p2:Person{name:'최민수'}))\n",
    "return [node in nodes(p) | node.name] AS path;\n",
    "\"\"\"\n",
    "graph.query(cypher_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "27b9753b",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'path': ['홍길동', '김철수', '정소라']}]"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#shortestPath 쿼리\n",
    "cypher_query = \"\"\"\n",
    "MATCH p=shortestPath((p1:Person{name:'홍길동'})-[*..3]-(p2:Person{name:'정소라'}))\n",
    "return [node in nodes(p) | node.name] AS path;\n",
    "\"\"\"\n",
    "graph.query(cypher_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "2ba7b731",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'total_people': 8}]"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher_query = \"\"\"\n",
    "MATCH (p1:Person)\n",
    "return count(p1) as total_people\n",
    "\"\"\"\n",
    "graph.query(cypher_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "ed089f41",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'city': '서울', 'total_people': 3},\n",
       " {'city': '부산', 'total_people': 2},\n",
       " {'city': '인천', 'total_people': 1},\n",
       " {'city': '대전', 'total_people': 1},\n",
       " {'city': '대구', 'total_people': 1}]"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher_query = \"\"\"\n",
    "MATCH (p:Person)\n",
    "RETURN p.city as city, count(p) as total_people\n",
    "ORDER BY total_people DESC\n",
    "\"\"\"\n",
    "graph.query(cypher_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "deef6962",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'average_age': 33.62500000000001}]"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher_query = \"\"\"\n",
    "Match (p:Person)\n",
    "return  AVG(p.age) as average_age\n",
    "\"\"\"\n",
    "graph.query(cypher_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "45d7f906",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'interest': '여행', 'total_people': 3},\n",
       " {'interest': '영화', 'total_people': 2},\n",
       " {'interest': '스포츠', 'total_people': 2},\n",
       " {'interest': '음악', 'total_people': 2},\n",
       " {'interest': '요리', 'total_people': 2}]"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher_query = \"\"\"\n",
    "Match (p:Person)-[:LIKES]->(i:Interest)\n",
    "RETURN i.name as interest, count(p) as total_people\n",
    "ORDER BY total_people DESC\n",
    "\"\"\"\n",
    "graph.query(cypher_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "c0d83bd5",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'location': '해운대', 'total_people': 4},\n",
       " {'location': '남산타워', 'total_people': 3},\n",
       " {'location': '경복궁', 'total_people': 2},\n",
       " {'location': '월미도', 'total_people': 1}]"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher_query = \"\"\"\n",
    "match (p:Person)-[:VISITED]->(l:Location)\n",
    "RETURN l.name as location, count(p) as total_people\n",
    "order by total_people DESC\n",
    "\"\"\"\n",
    "graph.query(cypher_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "b69aa0c4",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'location': '남산타워', 'average_rating': None}]"
      ]
     },
     "execution_count": 22,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher_query = \"\"\"\n",
    "match (p:Person)-[:VISITED]->(l:Location)\n",
    "RETURN l.name as location, avg(l.rating) as average_rating\n",
    "order by average_rating DESC\n",
    "limit 1\n",
    "\"\"\"\n",
    "graph.query(cypher_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "932bfb71",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "f3d0c66b",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": ".venv",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.0"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
