{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "d09ac4f8",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "True"
      ]
     },
     "execution_count": 1,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import os\n",
    "from dotenv import load_dotenv\n",
    "\n",
    "load_dotenv()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "98459d99",
   "metadata": {},
   "outputs": [],
   "source": [
    "from langchain_neo4j import Neo4jGraph\n",
    "\n",
    "graph = Neo4jGraph(\n",
    "    url=os.getenv(\"NEO4J_URI\"),\n",
    "    username=os.getenv(\"NEO4J_USERNAME\"),  \n",
    "    password=os.getenv(\"NEO4J_PASSWORD\"),\n",
    ") "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "67941598",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'n': {'name': 'Hello AuraDB'}}]"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# 테스트 쿼리 실행 \n",
    "cypher_query = \"\"\"\n",
    "CREATE (n:Test {name: \"Hello AuraDB\"}) \n",
    "RETURN n\n",
    "\"\"\"\n",
    "\n",
    "graph.query(cypher_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "cdabaf79",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "데이터베이스가 초기화되었습니다.\n"
     ]
    }
   ],
   "source": [
    "def reset_database(graph):\n",
    "    \"\"\"\n",
    "    데이터베이스 초기화하기\n",
    "    \"\"\"\n",
    "    # 모든 노드와 관계 삭제\n",
    "    graph.query(\"MATCH (n) DETACH DELETE n\")\n",
    "    \n",
    "    # 모든 제약조건 삭제\n",
    "    constraints = graph.query(\"SHOW CONSTRAINTS\")\n",
    "    for constraint in constraints:\n",
    "        constraint_name = constraint.get(\"name\")\n",
    "        if constraint_name:\n",
    "            graph.query(f\"DROP CONSTRAINT {constraint_name}\")\n",
    "    \n",
    "    # 모든 인덱스 삭제\n",
    "    indexes = graph.query(\"SHOW INDEXES\")\n",
    "    for index in indexes:\n",
    "        index_name = index.get(\"name\")\n",
    "        index_type = index.get(\"type\")\n",
    "        if index_name and index_type != \"CONSTRAINT\":\n",
    "            graph.query(f\"DROP INDEX {index_name}\")\n",
    "    \n",
    "    print(\"데이터베이스가 초기화되었습니다.\")\n",
    "\n",
    "# 데이터베이스 초기화\n",
    "reset_database(graph)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "9f779b93",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# 데이터 모델 정의 \n",
    "cypher_query =  \"\"\"\n",
    "// Person 노드 생성\n",
    "CREATE (p1:Person {name: '홍길동', age: 35, city: '서울'})\n",
    "CREATE (p2:Person {name: '김철수', age: 28, city: '부산'})\n",
    "CREATE (p3:Person {name: '이영희', age: 32, city: '서울'})\n",
    "CREATE (p4:Person {name: '박지성', age: 40, city: '인천'})\n",
    "CREATE (p5:Person {name: '최민수', age: 45, city: '대전'})\n",
    "CREATE (p6:Person {name: '정소라', age: 29, city: '부산'})\n",
    "CREATE (p7:Person {name: '강대호', age: 33, city: '서울'})\n",
    "CREATE (p8:Person {name: '윤미래', age: 27, city: '대구'})\n",
    "\n",
    "// 관심분야 노드 생성\n",
    "CREATE (i1:Interest {name: '영화'})\n",
    "CREATE (i2:Interest {name: '음악'})\n",
    "CREATE (i3:Interest {name: '스포츠'})\n",
    "CREATE (i4:Interest {name: '요리'})\n",
    "CREATE (i5:Interest {name: '여행'})\n",
    "\n",
    "// 장소 노드 생성\n",
    "CREATE (l1:Location {name: '남산타워', city: '서울'})\n",
    "CREATE (l2:Location {name: '해운대', city: '부산'})\n",
    "CREATE (l3:Location {name: '경복궁', city: '서울'})\n",
    "CREATE (l4:Location {name: '월미도', city: '인천'})\n",
    "\n",
    "// KNOWS 관계 생성 (사람들 간의 친구 관계)\n",
    "CREATE (p1)-[:KNOWS {since: 2010}]->(p2)\n",
    "CREATE (p1)-[:KNOWS {since: 2015}]->(p3)\n",
    "CREATE (p1)-[:KNOWS {since: 2012}]->(p7)\n",
    "CREATE (p2)-[:KNOWS {since: 2018}]->(p6)\n",
    "CREATE (p3)-[:KNOWS {since: 2017}]->(p4)\n",
    "CREATE (p3)-[:KNOWS {since: 2020}]->(p5)\n",
    "CREATE (p4)-[:KNOWS {since: 2019}]->(p5)\n",
    "CREATE (p6)-[:KNOWS {since: 2016}]->(p8)\n",
    "CREATE (p7)-[:KNOWS {since: 2014}]->(p3)\n",
    "CREATE (p7)-[:KNOWS {since: 2021}]->(p8)\n",
    "\n",
    "// LIKES 관계 생성 (사람과 관심분야 간의 관계)\n",
    "CREATE (p1)-[:LIKES {rating: 5}]->(i1)\n",
    "CREATE (p1)-[:LIKES {rating: 4}]->(i5)\n",
    "CREATE (p2)-[:LIKES {rating: 5}]->(i3)\n",
    "CREATE (p3)-[:LIKES {rating: 4}]->(i2)\n",
    "CREATE (p3)-[:LIKES {rating: 5}]->(i4)\n",
    "CREATE (p4)-[:LIKES {rating: 5}]->(i3)\n",
    "CREATE (p5)-[:LIKES {rating: 3}]->(i1)\n",
    "CREATE (p5)-[:LIKES {rating: 4}]->(i5)\n",
    "CREATE (p6)-[:LIKES {rating: 5}]->(i2)\n",
    "CREATE (p7)-[:LIKES {rating: 4}]->(i4)\n",
    "CREATE (p8)-[:LIKES {rating: 4}]->(i5)\n",
    "\n",
    "// VISITED 관계 생성 (사람과 장소 간의 관계)\n",
    "CREATE (p1)-[:VISITED {date: '2022-03-15', rating: 4}]->(l1)\n",
    "CREATE (p1)-[:VISITED {date: '2022-05-20', rating: 5}]->(l2)\n",
    "CREATE (p2)-[:VISITED {date: '2022-04-10', rating: 3}]->(l2)\n",
    "CREATE (p3)-[:VISITED {date: '2022-06-05', rating: 5}]->(l3)\n",
    "CREATE (p4)-[:VISITED {date: '2022-07-12', rating: 4}]->(l4)\n",
    "CREATE (p4)-[:VISITED {date: '2022-02-28', rating: 5}]->(l1)\n",
    "CREATE (p5)-[:VISITED {date: '2022-08-03', rating: 4}]->(l3)\n",
    "CREATE (p6)-[:VISITED {date: '2022-01-17', rating: 5}]->(l2)\n",
    "CREATE (p7)-[:VISITED {date: '2022-09-22', rating: 3}]->(l1)\n",
    "CREATE (p8)-[:VISITED {date: '2022-10-08', rating: 4}]->(l2)\n",
    "\"\"\"\n",
    "\n",
    "graph.query(cypher_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "f39f5388",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'start': '홍길동', 'relationships': ['KNOWS(2010)'], 'end': '김철수'},\n",
       " {'start': '홍길동',\n",
       "  'relationships': ['KNOWS(2010)', 'KNOWS(2018)'],\n",
       "  'end': '정소라'},\n",
       " {'start': '홍길동',\n",
       "  'relationships': ['KNOWS(2010)', 'KNOWS(2018)', 'KNOWS(2016)'],\n",
       "  'end': '윤미래'},\n",
       " {'start': '홍길동', 'relationships': ['KNOWS(2015)'], 'end': '이영희'},\n",
       " {'start': '홍길동',\n",
       "  'relationships': ['KNOWS(2015)', 'KNOWS(2017)'],\n",
       "  'end': '박지성'},\n",
       " {'start': '홍길동',\n",
       "  'relationships': ['KNOWS(2015)', 'KNOWS(2017)', 'KNOWS(2019)'],\n",
       "  'end': '최민수'},\n",
       " {'start': '홍길동',\n",
       "  'relationships': ['KNOWS(2015)', 'KNOWS(2020)'],\n",
       "  'end': '최민수'},\n",
       " {'start': '홍길동', 'relationships': ['KNOWS(2012)'], 'end': '강대호'},\n",
       " {'start': '홍길동',\n",
       "  'relationships': ['KNOWS(2012)', 'KNOWS(2014)'],\n",
       "  'end': '이영희'},\n",
       " {'start': '홍길동',\n",
       "  'relationships': ['KNOWS(2012)', 'KNOWS(2014)', 'KNOWS(2017)'],\n",
       "  'end': '박지성'},\n",
       " {'start': '홍길동',\n",
       "  'relationships': ['KNOWS(2012)', 'KNOWS(2014)', 'KNOWS(2020)'],\n",
       "  'end': '최민수'},\n",
       " {'start': '홍길동',\n",
       "  'relationships': ['KNOWS(2012)', 'KNOWS(2021)'],\n",
       "  'end': '윤미래'}]"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher_query = \"\"\"\n",
    "MATCH (p1:Person{name:'홍길동'})-[r:KNOWS*1..3]->(p2:Person)\n",
    "RETURN p1.name AS start,[rel in r | type(rel) + '('+ rel.since + ')'] AS relationships, p2.name AS end\n",
    "\n",
    "\"\"\"\n",
    "graph.query(cypher_query)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "4a102886",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'start': '홍길동', 'end': '이영희'},\n",
       " {'start': '홍길동', 'end': '박지성'},\n",
       " {'start': '홍길동', 'end': '최민수'},\n",
       " {'start': '홍길동', 'end': '정소라'},\n",
       " {'start': '홍길동', 'end': '윤미래'}]"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher_query = \"\"\"\n",
    "MATCH (p1:Person{name:'홍길동'})-[r:KNOWS*2]->(p2:Person)\n",
    "RETURN p1.name AS start, p2.name AS end\n",
    "\n",
    "\"\"\"\n",
    "graph.query(cypher_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "538a7978",
   "metadata": {},
   "outputs": [
    {
     "ename": "SyntaxError",
     "evalue": "incomplete input (2383436071.py, line 1)",
     "output_type": "error",
     "traceback": [
      "  \u001b[36mCell\u001b[39m\u001b[36m \u001b[39m\u001b[32mIn[13]\u001b[39m\u001b[32m, line 1\u001b[39m\n\u001b[31m    \u001b[39m\u001b[31mcypher_query = \"\"\"\u001b[39m\n                   ^\n\u001b[31mSyntaxError\u001b[39m\u001b[31m:\u001b[39m incomplete input\n"
     ]
    }
   ],
   "source": [
    "cypher_query = \"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "391e293c",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'start': '홍길동', 'end': '김철수', 'degree': 1},\n",
       " {'start': '홍길동', 'end': '정소라', 'degree': 2},\n",
       " {'start': '홍길동', 'end': '윤미래', 'degree': 3},\n",
       " {'start': '홍길동', 'end': '이영희', 'degree': 1},\n",
       " {'start': '홍길동', 'end': '박지성', 'degree': 2},\n",
       " {'start': '홍길동', 'end': '최민수', 'degree': 3},\n",
       " {'start': '홍길동', 'end': '최민수', 'degree': 2},\n",
       " {'start': '홍길동', 'end': '강대호', 'degree': 1},\n",
       " {'start': '홍길동', 'end': '이영희', 'degree': 2},\n",
       " {'start': '홍길동', 'end': '박지성', 'degree': 3},\n",
       " {'start': '홍길동', 'end': '최민수', 'degree': 4},\n",
       " {'start': '홍길동', 'end': '최민수', 'degree': 3},\n",
       " {'start': '홍길동', 'end': '윤미래', 'degree': 2}]"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    },
    {
     "ename": "",
     "evalue": "",
     "output_type": "error",
     "traceback": [
      "\u001b[1;31m현재 셀 또는 이전 셀에서 코드를 실행하는 동안 Kernel이 충돌했습니다. \n",
      "\u001b[1;31m셀의 코드를 검토하여 가능한 오류 원인을 식별하세요. \n",
      "\u001b[1;31m자세한 내용을 보려면 <a href='https://aka.ms/vscodeJupyterKernelCrash'>여기</a>를 클릭하세요. \n",
      "\u001b[1;31m자세한 내용은 Jupyter <a href='command:jupyter.viewOutput'>로그</a>를 참조하세요."
     ]
    }
   ],
   "source": [
    "cypher_query = \"\"\"\n",
    "MATCH (p:Person{name: '홍길동'})-[r:KNOWS*]->(p2:Person)\n",
    "RETURN p.name AS start, p2.name AS end, SIZE(r) as degree\n",
    "\"\"\"\n",
    "graph.query(cypher_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "37f335d5",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'path': ['홍길동', '이영희', '최민수']}]"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#shortestPath 쿼리\n",
    "cypher_query = \"\"\"\n",
    "MATCH p=shortestPath((p1:Person{name:'홍길동'})-[:KNOWS*]-(p2:Person{name:'최민수'}))\n",
    "return [node in nodes(p) | node.name] AS path;\n",
    "\"\"\"\n",
    "graph.query(cypher_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "27b9753b",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'path': ['홍길동', '김철수', '정소라']}]"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#shortestPath 쿼리\n",
    "cypher_query = \"\"\"\n",
    "MATCH p=shortestPath((p1:Person{name:'홍길동'})-[*..3]-(p2:Person{name:'정소라'}))\n",
    "return [node in nodes(p) | node.name] AS path;\n",
    "\"\"\"\n",
    "graph.query(cypher_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "2ba7b731",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'total_people': 8}]"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher_query = \"\"\"\n",
    "MATCH (p1:Person)\n",
    "return count(p1) as total_people\n",
    "\"\"\"\n",
    "graph.query(cypher_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "ed089f41",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'city': '서울', 'total_people': 3},\n",
       " {'city': '부산', 'total_people': 2},\n",
       " {'city': '인천', 'total_people': 1},\n",
       " {'city': '대전', 'total_people': 1},\n",
       " {'city': '대구', 'total_people': 1}]"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher_query = \"\"\"\n",
    "MATCH (p:Person)\n",
    "RETURN p.city as city, count(p) as total_people\n",
    "ORDER BY total_people DESC\n",
    "\"\"\"\n",
    "graph.query(cypher_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "deef6962",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'average_age': 33.62500000000001}]"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher_query = \"\"\"\n",
    "Match (p:Person)\n",
    "return  AVG(p.age) as average_age\n",
    "\"\"\"\n",
    "graph.query(cypher_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "45d7f906",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'interest': '여행', 'total_people': 3},\n",
       " {'interest': '영화', 'total_people': 2},\n",
       " {'interest': '스포츠', 'total_people': 2},\n",
       " {'interest': '음악', 'total_people': 2},\n",
       " {'interest': '요리', 'total_people': 2}]"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher_query = \"\"\"\n",
    "Match (p:Person)-[:LIKES]->(i:Interest)\n",
    "RETURN i.name as interest, count(p) as total_people\n",
    "ORDER BY total_people DESC\n",
    "\"\"\"\n",
    "graph.query(cypher_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "c0d83bd5",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'location': '해운대', 'total_people': 4},\n",
       " {'location': '남산타워', 'total_people': 3},\n",
       " {'location': '경복궁', 'total_people': 2},\n",
       " {'location': '월미도', 'total_people': 1}]"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher_query = \"\"\"\n",
    "match (p:Person)-[:VISITED]->(l:Location)\n",
    "RETURN l.name as location, count(p) as total_people\n",
    "order by total_people DESC\n",
    "\"\"\"\n",
    "graph.query(cypher_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "b69aa0c4",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'location': '남산타워', 'average_rating': None}]"
      ]
     },
     "execution_count": 22,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher_query = \"\"\"\n",
    "match (p:Person)-[:VISITED]->(l:Location)\n",
    "RETURN l.name as location, avg(l.rating) as average_rating\n",
    "order by average_rating DESC\n",
    "limit 1\n",
    "\"\"\"\n",
    "graph.query(cypher_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "932bfb71",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'location': '경복궁', 'average_rating': 4.5}]"
      ]
     },
     "execution_count": 24,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# intended query :\n",
    "cypher_query = \"\"\"\n",
    "MATCH (p:Person)-[v:VISITED]->(l:Location)\n",
    "RETURN l.name AS location,\n",
    "avg(v.rating) AS average_rating\n",
    "ORDER BY average_rating DESC\n",
    "LIMIT 1\n",
    "\"\"\"\n",
    "graph.query(cypher_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "id": "f3d0c66b",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'location': '경복궁', 'visitors': 2, 'average_rating': 4.5}]"
      ]
     },
     "execution_count": 25,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#방문자 수까지 같이 보고 싶으면:\n",
    "cypher_query = \"\"\"\n",
    "MATCH (p:Person)-[v:VISITED]->(l:Location)\n",
    "RETURN l.name AS location,\n",
    "count(p) AS visitors,\n",
    "avg(v.rating) AS average_rating\n",
    "ORDER BY average_rating DESC\n",
    "LIMIT 1\n",
    "\"\"\"\n",
    "graph.query(cypher_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "id": "893e1f47",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'name': '김철수', 'age': 28}]"
      ]
     },
     "execution_count": 28,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher_query = \"\"\"\n",
    "Match (p:Person)\n",
    "WHERE p.age > 20\n",
    "with p\n",
    "where p.name contains '김'\n",
    "return p.name as name, p.age as age\n",
    "\"\"\"\n",
    "graph.query(cypher_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "id": "c06153fe",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'city': '대전', 'average_age': 45.0}, {'city': '인천', 'average_age': 40.0}]"
      ]
     },
     "execution_count": 33,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher_query = \"\"\"\n",
    "match (p:Person)\n",
    "with p.city as city, avg(p.age) as average_age\n",
    "\n",
    "where average_age > 35\n",
    "return city, average_age\n",
    "order by average_age DESC\n",
    "\"\"\"\n",
    "graph.query(cypher_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "id": "688ee6b8",
   "metadata": {},
   "outputs": [
    {
     "ename": "CypherSyntaxError",
     "evalue": "{neo4j_code: Neo.ClientError.Statement.SyntaxError} {message: Invalid input 'as': expected an expression, 'ORDER BY', 'CALL', 'CREATE', 'LOAD CSV', 'DELETE', 'DETACH', 'FILTER', 'FINISH', 'FOR', 'FOREACH', 'INSERT', 'LET', 'LIMIT', 'MATCH', 'MERGE', 'NEXT', 'NODETACH', 'OFFSET', 'OPTIONAL', 'REMOVE', 'RETURN', 'SEARCH', 'SET', 'SHOW', 'SKIP', 'TERMINATE', 'UNION', 'UNWIND', 'USE', 'WITH' or <EOF> (line 3, column 14 (offset: 31))\r\n\"where p.city as city, avg(p.age) as average_age\"\r\n              ^} {gql_status: 42001} {gql_status_description: error: syntax error or access rule violation - invalid syntax}",
     "output_type": "error",
     "traceback": [
      "\u001b[31m---------------------------------------------------------------------------\u001b[39m",
      "\u001b[31mGqlError\u001b[39m                                  Traceback (most recent call last)",
      "\u001b[31mGqlError\u001b[39m: {gql_status: 42I06} {gql_status_description: error: syntax error or access rule violation - invalid input. Invalid input 'as', expected: an expression, 'ORDER BY', 'CALL', 'CREATE', 'LOAD CSV', 'DELETE', 'DETACH', 'FILTER', 'FINISH', 'FOR', 'FOREACH', 'INSERT', 'LET', 'LIMIT', 'MATCH', 'MERGE', 'NEXT', 'NODETACH', 'OFFSET', 'OPTIONAL', 'REMOVE', 'RETURN', 'SEARCH', 'SET', 'SHOW', 'SKIP', 'TERMINATE', 'UNION', 'UNWIND', 'USE', 'WITH' or <EOF>.} {message: 42I06: Invalid input 'as', expected: an expression, 'ORDER BY', 'CALL', 'CREATE', 'LOAD CSV', 'DELETE', 'DETACH', 'FILTER', 'FINISH', 'FOR', 'FOREACH', 'INSERT', 'LET', 'LIMIT', 'MATCH', 'MERGE', 'NEXT', 'NODETACH', 'OFFSET', 'OPTIONAL', 'REMOVE', 'RETURN', 'SEARCH', 'SET', 'SHOW', 'SKIP', 'TERMINATE', 'UNION', 'UNWIND', 'USE', 'WITH' or <EOF>.} {diagnostic_record: {'_classification': 'CLIENT_ERROR', '_position': {'offset': 31, 'column': 14, 'line': 3}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}} {raw_classification: CLIENT_ERROR}",
      "\nThe above exception was the direct cause of the following exception:\n",
      "\u001b[31mCypherSyntaxError\u001b[39m                         Traceback (most recent call last)",
      "\u001b[36mCell\u001b[39m\u001b[36m \u001b[39m\u001b[32mIn[34]\u001b[39m\u001b[32m, line 9\u001b[39m\n\u001b[32m      5\u001b[39m where average_age > \u001b[32m35\u001b[39m\n\u001b[32m      6\u001b[39m \u001b[38;5;28;01mreturn\u001b[39;00m city, average_age\n\u001b[32m      7\u001b[39m order by average_age DESC\n\u001b[32m      8\u001b[39m \"\"\"\n\u001b[32m----> \u001b[39m\u001b[32m9\u001b[39m graph.query(cypher_query)\n",
      "\u001b[36mFile \u001b[39m\u001b[32mc:\\Users\\user\\neo4j-SicPama\\.venv\\Lib\\site-packages\\langchain_neo4j\\graphs\\neo4j_graph.py:245\u001b[39m, in \u001b[36mNeo4jGraph.query\u001b[39m\u001b[34m(self, query, params, session_params)\u001b[39m\n\u001b[32m    243\u001b[39m \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;129;01mnot\u001b[39;00m session_params:\n\u001b[32m    244\u001b[39m     \u001b[38;5;28;01mtry\u001b[39;00m:\n\u001b[32m--> \u001b[39m\u001b[32m245\u001b[39m         data, _, _ = \u001b[30;43mself\u001b[39;49m\u001b[30;43m.\u001b[39;49m\u001b[30;43m_driver\u001b[39;49m\u001b[30;43m.\u001b[39;49m\u001b[30;43mexecute_query\u001b[39;49m\u001b[30;43m(\u001b[39;49m\n\u001b[32m    246\u001b[39m \u001b[30;43m            \u001b[39;49m\u001b[30;43mQuery\u001b[39;49m\u001b[30;43m(\u001b[39;49m\u001b[30;43mtext\u001b[39;49m\u001b[30;43m=\u001b[39;49m\u001b[30;43mquery\u001b[39;49m\u001b[30;43m,\u001b[39;49m\u001b[30;43m \u001b[39;49m\u001b[30;43mtimeout\u001b[39;49m\u001b[30;43m=\u001b[39;49m\u001b[30;43mself\u001b[39;49m\u001b[30;43m.\u001b[39;49m\u001b[30;43mtimeout\u001b[39;49m\u001b[30;43m)\u001b[39;49m\u001b[30;43m,\u001b[39;49m\n\u001b[32m    247\u001b[39m \u001b[30;43m            \u001b[39;49m\u001b[30;43mdatabase_\u001b[39;49m\u001b[30;43m=\u001b[39;49m\u001b[30;43mself\u001b[39;49m\u001b[30;43m.\u001b[39;49m\u001b[30;43m_database\u001b[39;49m\u001b[30;43m,\u001b[39;49m\n\u001b[32m    248\u001b[39m \u001b[30;43m            \u001b[39;49m\u001b[30;43mparameters_\u001b[39;49m\u001b[30;43m=\u001b[39;49m\u001b[30;43mparams\u001b[39;49m\u001b[30;43m,\u001b[39;49m\n\u001b[32m    249\u001b[39m \u001b[30;43m        \u001b[39;49m\u001b[30;43m)\u001b[39;49m\n\u001b[32m    250\u001b[39m         json_data = [r.data() \u001b[38;5;28;01mfor\u001b[39;00m r \u001b[38;5;129;01min\u001b[39;00m data]\n\u001b[32m    251\u001b[39m         \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;28mself\u001b[39m.sanitize:\n",
      "\u001b[36mFile \u001b[39m\u001b[32mc:\\Users\\user\\neo4j-SicPama\\.venv\\Lib\\site-packages\\neo4j\\_sync\\driver.py:950\u001b[39m, in \u001b[36mDriver.execute_query\u001b[39m\u001b[34m(self, query_, parameters_, routing_, database_, impersonated_user_, bookmark_manager_, auth_, result_transformer_, **kwargs)\u001b[39m\n\u001b[32m    946\u001b[39m     \u001b[38;5;28;01mraise\u001b[39;00m \u001b[38;5;167;01mValueError\u001b[39;00m(\n\u001b[32m    947\u001b[39m         \u001b[33mf\u001b[39m\u001b[33m\"\u001b[39m\u001b[33mInvalid routing control value: \u001b[39m\u001b[38;5;132;01m{\u001b[39;00mrouting_\u001b[38;5;132;01m!r}\u001b[39;00m\u001b[33m\"\u001b[39m\n\u001b[32m    948\u001b[39m     )\n\u001b[32m    949\u001b[39m \u001b[38;5;28;01mwith\u001b[39;00m session._pipelined_begin:\n\u001b[32m--> \u001b[39m\u001b[32m950\u001b[39m     \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[30;43msession\u001b[39;49m\u001b[30;43m.\u001b[39;49m\u001b[30;43m_run_transaction\u001b[39;49m\u001b[30;43m(\u001b[39;49m\n\u001b[32m    951\u001b[39m \u001b[30;43m        \u001b[39;49m\u001b[30;43maccess_mode\u001b[39;49m\u001b[30;43m,\u001b[39;49m\n\u001b[32m    952\u001b[39m \u001b[30;43m        \u001b[39;49m\u001b[30;43mTelemetryAPI\u001b[39;49m\u001b[30;43m.\u001b[39;49m\u001b[30;43mDRIVER\u001b[39;49m\u001b[30;43m,\u001b[39;49m\n\u001b[32m    953\u001b[39m \u001b[30;43m        \u001b[39;49m\u001b[30;43mwork\u001b[39;49m\u001b[30;43m,\u001b[39;49m\n\u001b[32m    954\u001b[39m \u001b[30;43m        \u001b[39;49m\u001b[30;43m(\u001b[39;49m\u001b[30;43mquery_str\u001b[39;49m\u001b[30;43m,\u001b[39;49m\u001b[30;43m \u001b[39;49m\u001b[30;43mparameters\u001b[39;49m\u001b[30;43m,\u001b[39;49m\u001b[30;43m \u001b[39;49m\u001b[30;43mresult_transformer_\u001b[39;49m\u001b[30;43m)\u001b[39;49m\u001b[30;43m,\u001b[39;49m\n\u001b[32m    955\u001b[39m \u001b[30;43m        \u001b[39;49m\u001b[30;43m{\u001b[39;49m\u001b[30;43m}\u001b[39;49m\u001b[30;43m,\u001b[39;49m\n\u001b[32m    956\u001b[39m \u001b[30;43m    \u001b[39;49m\u001b[30;43m)\u001b[39;49m\n",
      "\u001b[36mFile \u001b[39m\u001b[32mc:\\Users\\user\\neo4j-SicPama\\.venv\\Lib\\site-packages\\neo4j\\_sync\\work\\session.py:577\u001b[39m, in \u001b[36mSession._run_transaction\u001b[39m\u001b[34m(self, access_mode, api, transaction_function, args, kwargs)\u001b[39m\n\u001b[32m    575\u001b[39m tx = \u001b[38;5;28mself\u001b[39m._transaction\n\u001b[32m    576\u001b[39m \u001b[38;5;28;01mtry\u001b[39;00m:\n\u001b[32m--> \u001b[39m\u001b[32m577\u001b[39m     result = \u001b[30;43mtransaction_function\u001b[39;49m\u001b[30;43m(\u001b[39;49m\u001b[30;43mtx\u001b[39;49m\u001b[30;43m,\u001b[39;49m\u001b[30;43m \u001b[39;49m\u001b[30;43m*\u001b[39;49m\u001b[30;43margs\u001b[39;49m\u001b[30;43m,\u001b[39;49m\u001b[30;43m \u001b[39;49m\u001b[30;43m*\u001b[39;49m\u001b[30;43m*\u001b[39;49m\u001b[30;43mkwargs\u001b[39;49m\u001b[30;43m)\u001b[39;49m\n\u001b[32m    578\u001b[39m \u001b[38;5;28;01mexcept\u001b[39;00m asyncio.CancelledError:\n\u001b[32m    579\u001b[39m     \u001b[38;5;66;03m# if cancellation callback has not been called yet:\u001b[39;00m\n\u001b[32m    580\u001b[39m     \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;28mself\u001b[39m._transaction \u001b[38;5;129;01mis\u001b[39;00m \u001b[38;5;129;01mnot\u001b[39;00m \u001b[38;5;28;01mNone\u001b[39;00m:\n",
      "\u001b[36mFile \u001b[39m\u001b[32mc:\\Users\\user\\neo4j-SicPama\\.venv\\Lib\\site-packages\\neo4j\\_work\\query.py:142\u001b[39m, in \u001b[36munit_of_work.<locals>.wrapper.<locals>.wrapped\u001b[39m\u001b[34m(*args, **kwargs)\u001b[39m\n\u001b[32m    141\u001b[39m \u001b[38;5;28;01mdef\u001b[39;00m\u001b[38;5;250m \u001b[39m\u001b[34mwrapped\u001b[39m(*args, **kwargs):\n\u001b[32m--> \u001b[39m\u001b[32m142\u001b[39m     \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[30;43mf\u001b[39;49m\u001b[30;43m(\u001b[39;49m\u001b[30;43m*\u001b[39;49m\u001b[30;43margs\u001b[39;49m\u001b[30;43m,\u001b[39;49m\u001b[30;43m \u001b[39;49m\u001b[30;43m*\u001b[39;49m\u001b[30;43m*\u001b[39;49m\u001b[30;43mkwargs\u001b[39;49m\u001b[30;43m)\u001b[39;49m\n",
      "\u001b[36mFile \u001b[39m\u001b[32mc:\\Users\\user\\neo4j-SicPama\\.venv\\Lib\\site-packages\\neo4j\\_sync\\driver.py:1302\u001b[39m, in \u001b[36m_work\u001b[39m\u001b[34m(tx, query, parameters, transformer)\u001b[39m\n\u001b[32m   1296\u001b[39m \u001b[38;5;28;01mdef\u001b[39;00m\u001b[38;5;250m \u001b[39m\u001b[34m_work\u001b[39m(\n\u001b[32m   1297\u001b[39m     tx: ManagedTransaction,\n\u001b[32m   1298\u001b[39m     query: t.LiteralString,\n\u001b[32m   1299\u001b[39m     parameters: \u001b[38;5;28mdict\u001b[39m[\u001b[38;5;28mstr\u001b[39m, t.Any],\n\u001b[32m   1300\u001b[39m     transformer: t.Callable[[Result], t.Union[_T]],\n\u001b[32m   1301\u001b[39m ) -> _T:\n\u001b[32m-> \u001b[39m\u001b[32m1302\u001b[39m     res = \u001b[30;43mtx\u001b[39;49m\u001b[30;43m.\u001b[39;49m\u001b[30;43mrun\u001b[39;49m\u001b[30;43m(\u001b[39;49m\u001b[30;43mquery\u001b[39;49m\u001b[30;43m,\u001b[39;49m\u001b[30;43m \u001b[39;49m\u001b[30;43mparameters\u001b[39;49m\u001b[30;43m)\u001b[39;49m\n\u001b[32m   1303\u001b[39m     \u001b[38;5;28;01mreturn\u001b[39;00m transformer(res)\n",
      "\u001b[36mFile \u001b[39m\u001b[32mc:\\Users\\user\\neo4j-SicPama\\.venv\\Lib\\site-packages\\neo4j\\_sync\\work\\transaction.py:201\u001b[39m, in \u001b[36mTransactionBase.run\u001b[39m\u001b[34m(self, query, parameters, **kwparameters)\u001b[39m\n\u001b[32m    198\u001b[39m \u001b[38;5;28mself\u001b[39m._results.append(result)\n\u001b[32m    200\u001b[39m parameters = \u001b[38;5;28mdict\u001b[39m(parameters \u001b[38;5;129;01mor\u001b[39;00m {}, **kwparameters)\n\u001b[32m--> \u001b[39m\u001b[32m201\u001b[39m \u001b[30;43mresult\u001b[39;49m\u001b[30;43m.\u001b[39;49m\u001b[30;43m_tx_ready_run\u001b[39;49m\u001b[30;43m(\u001b[39;49m\u001b[30;43mquery\u001b[39;49m\u001b[30;43m,\u001b[39;49m\u001b[30;43m \u001b[39;49m\u001b[30;43mparameters\u001b[39;49m\u001b[30;43m)\u001b[39;49m\n\u001b[32m    203\u001b[39m \u001b[38;5;28;01mreturn\u001b[39;00m result\n",
      "\u001b[36mFile \u001b[39m\u001b[32mc:\\Users\\user\\neo4j-SicPama\\.venv\\Lib\\site-packages\\neo4j\\_sync\\work\\result.py:180\u001b[39m, in \u001b[36mResult._tx_ready_run\u001b[39m\u001b[34m(self, query, parameters)\u001b[39m\n\u001b[32m    176\u001b[39m \u001b[38;5;28;01mdef\u001b[39;00m\u001b[38;5;250m \u001b[39m\u001b[34m_tx_ready_run\u001b[39m(\u001b[38;5;28mself\u001b[39m, query, parameters):\n\u001b[32m    177\u001b[39m     \u001b[38;5;66;03m# BEGIN+RUN does not carry any extra on the RUN message.\u001b[39;00m\n\u001b[32m    178\u001b[39m     \u001b[38;5;66;03m# BEGIN {extra}\u001b[39;00m\n\u001b[32m    179\u001b[39m     \u001b[38;5;66;03m# RUN \"query\" {parameters} {extra}\u001b[39;00m\n\u001b[32m--> \u001b[39m\u001b[32m180\u001b[39m     \u001b[30;43mself\u001b[39;49m\u001b[30;43m.\u001b[39;49m\u001b[30;43m_run\u001b[39;49m\u001b[30;43m(\u001b[39;49m\u001b[30;43mquery\u001b[39;49m\u001b[30;43m,\u001b[39;49m\u001b[30;43m \u001b[39;49m\u001b[30;43mparameters\u001b[39;49m\u001b[30;43m,\u001b[39;49m\u001b[30;43m \u001b[39;49m\u001b[30;43;01mNone\u001b[39;49;00m\u001b[30;43m,\u001b[39;49m\u001b[30;43m \u001b[39;49m\u001b[30;43;01mNone\u001b[39;49;00m\u001b[30;43m,\u001b[39;49m\u001b[30;43m \u001b[39;49m\u001b[30;43;01mNone\u001b[39;49;00m\u001b[30;43m,\u001b[39;49m\u001b[30;43m \u001b[39;49m\u001b[30;43;01mNone\u001b[39;49;00m\u001b[30;43m,\u001b[39;49m\u001b[30;43m \u001b[39;49m\u001b[30;43;01mNone\u001b[39;49;00m\u001b[30;43m,\u001b[39;49m\u001b[30;43m \u001b[39;49m\u001b[30;43;01mNone\u001b[39;49;00m\u001b[30;43m)\u001b[39;49m\n",
      "\u001b[36mFile \u001b[39m\u001b[32mc:\\Users\\user\\neo4j-SicPama\\.venv\\Lib\\site-packages\\neo4j\\_sync\\work\\result.py:240\u001b[39m, in \u001b[36mResult._run\u001b[39m\u001b[34m(self, query, parameters, db, imp_user, access_mode, bookmarks, notifications_min_severity, notifications_disabled_classifications)\u001b[39m\n\u001b[32m    238\u001b[39m \u001b[38;5;28mself\u001b[39m._pull()\n\u001b[32m    239\u001b[39m \u001b[38;5;28mself\u001b[39m._connection.send_all()\n\u001b[32m--> \u001b[39m\u001b[32m240\u001b[39m \u001b[30;43mself\u001b[39;49m\u001b[30;43m.\u001b[39;49m\u001b[30;43m_attach\u001b[39;49m\u001b[30;43m(\u001b[39;49m\u001b[30;43m)\u001b[39;49m\n",
      "\u001b[36mFile \u001b[39m\u001b[32mc:\\Users\\user\\neo4j-SicPama\\.venv\\Lib\\site-packages\\neo4j\\_sync\\work\\result.py:441\u001b[39m, in \u001b[36mResult._attach\u001b[39m\u001b[34m(self)\u001b[39m\n\u001b[32m    439\u001b[39m \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;28mself\u001b[39m._exhausted \u001b[38;5;129;01mis\u001b[39;00m \u001b[38;5;28;01mFalse\u001b[39;00m:\n\u001b[32m    440\u001b[39m     \u001b[38;5;28;01mwhile\u001b[39;00m \u001b[38;5;28mself\u001b[39m._attached \u001b[38;5;129;01mis\u001b[39;00m \u001b[38;5;28;01mFalse\u001b[39;00m:\n\u001b[32m--> \u001b[39m\u001b[32m441\u001b[39m         \u001b[30;43mself\u001b[39;49m\u001b[30;43m.\u001b[39;49m\u001b[30;43m_connection\u001b[39;49m\u001b[30;43m.\u001b[39;49m\u001b[30;43mfetch_message\u001b[39;49m\u001b[30;43m(\u001b[39;49m\u001b[30;43m)\u001b[39;49m\n",
      "\u001b[36mFile \u001b[39m\u001b[32mc:\\Users\\user\\neo4j-SicPama\\.venv\\Lib\\site-packages\\neo4j\\_sync\\io\\_common.py:193\u001b[39m, in \u001b[36mConnectionErrorHandler.__getattr__.<locals>.outer.<locals>.inner\u001b[39m\u001b[34m(*args, **kwargs)\u001b[39m\n\u001b[32m    191\u001b[39m \u001b[38;5;28;01mdef\u001b[39;00m\u001b[38;5;250m \u001b[39m\u001b[34minner\u001b[39m(*args, **kwargs):\n\u001b[32m    192\u001b[39m     \u001b[38;5;28;01mtry\u001b[39;00m:\n\u001b[32m--> \u001b[39m\u001b[32m193\u001b[39m         \u001b[30;43mfunc\u001b[39;49m\u001b[30;43m(\u001b[39;49m\u001b[30;43m*\u001b[39;49m\u001b[30;43margs\u001b[39;49m\u001b[30;43m,\u001b[39;49m\u001b[30;43m \u001b[39;49m\u001b[30;43m*\u001b[39;49m\u001b[30;43m*\u001b[39;49m\u001b[30;43mkwargs\u001b[39;49m\u001b[30;43m)\u001b[39;49m\n\u001b[32m    194\u001b[39m     \u001b[38;5;28;01mexcept\u001b[39;00m (Neo4jError, ServiceUnavailable, SessionExpired) \u001b[38;5;28;01mas\u001b[39;00m exc:\n\u001b[32m    195\u001b[39m         \u001b[38;5;28;01massert\u001b[39;00m \u001b[38;5;129;01mnot\u001b[39;00m inspect.iscoroutinefunction(\u001b[38;5;28mself\u001b[39m.__on_error)\n",
      "\u001b[36mFile \u001b[39m\u001b[32mc:\\Users\\user\\neo4j-SicPama\\.venv\\Lib\\site-packages\\neo4j\\_sync\\io\\_bolt.py:868\u001b[39m, in \u001b[36mBolt.fetch_message\u001b[39m\u001b[34m(self)\u001b[39m\n\u001b[32m    864\u001b[39m \u001b[38;5;66;03m# Receive exactly one message\u001b[39;00m\n\u001b[32m    865\u001b[39m tag, fields = \u001b[38;5;28mself\u001b[39m.inbox.pop(\n\u001b[32m    866\u001b[39m     hydration_hooks=\u001b[38;5;28mself\u001b[39m.responses[\u001b[32m0\u001b[39m].hydration_hooks\n\u001b[32m    867\u001b[39m )\n\u001b[32m--> \u001b[39m\u001b[32m868\u001b[39m res = \u001b[30;43mself\u001b[39;49m\u001b[30;43m.\u001b[39;49m\u001b[30;43m_process_message\u001b[39;49m\u001b[30;43m(\u001b[39;49m\u001b[30;43mtag\u001b[39;49m\u001b[30;43m,\u001b[39;49m\u001b[30;43m \u001b[39;49m\u001b[30;43mfields\u001b[39;49m\u001b[30;43m)\u001b[39;49m\n\u001b[32m    869\u001b[39m \u001b[38;5;28mself\u001b[39m.idle_since = monotonic()\n\u001b[32m    870\u001b[39m \u001b[38;5;28;01mreturn\u001b[39;00m res\n",
      "\u001b[36mFile \u001b[39m\u001b[32mc:\\Users\\user\\neo4j-SicPama\\.venv\\Lib\\site-packages\\neo4j\\_sync\\io\\_bolt6.py:548\u001b[39m, in \u001b[36mBolt6x0._process_message\u001b[39m\u001b[34m(self, tag, fields)\u001b[39m\n\u001b[32m    546\u001b[39m \u001b[38;5;28mself\u001b[39m._enrich_error_diagnostic_record(summary_metadata)\n\u001b[32m    547\u001b[39m \u001b[38;5;28;01mtry\u001b[39;00m:\n\u001b[32m--> \u001b[39m\u001b[32m548\u001b[39m     \u001b[30;43mresponse\u001b[39;49m\u001b[30;43m.\u001b[39;49m\u001b[30;43mon_failure\u001b[39;49m\u001b[30;43m(\u001b[39;49m\u001b[30;43msummary_metadata\u001b[39;49m\u001b[30;43m \u001b[39;49m\u001b[30;43;01mor\u001b[39;49;00m\u001b[30;43m \u001b[39;49m\u001b[30;43m{\u001b[39;49m\u001b[30;43m}\u001b[39;49m\u001b[30;43m)\u001b[39;49m\n\u001b[32m    549\u001b[39m \u001b[38;5;28;01mexcept\u001b[39;00m (ServiceUnavailable, DatabaseUnavailable):\n\u001b[32m    550\u001b[39m     \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;28mself\u001b[39m.pool:\n",
      "\u001b[36mFile \u001b[39m\u001b[32mc:\\Users\\user\\neo4j-SicPama\\.venv\\Lib\\site-packages\\neo4j\\_sync\\io\\_common.py:263\u001b[39m, in \u001b[36mResponse.on_failure\u001b[39m\u001b[34m(self, metadata)\u001b[39m\n\u001b[32m    261\u001b[39m handler = \u001b[38;5;28mself\u001b[39m.handlers.get(\u001b[33m\"\u001b[39m\u001b[33mon_summary\u001b[39m\u001b[33m\"\u001b[39m)\n\u001b[32m    262\u001b[39m Util.callback(handler)\n\u001b[32m--> \u001b[39m\u001b[32m263\u001b[39m \u001b[38;5;28;01mraise\u001b[39;00m \u001b[38;5;28mself\u001b[39m._hydrate_error(metadata)\n",
      "\u001b[31mCypherSyntaxError\u001b[39m: {neo4j_code: Neo.ClientError.Statement.SyntaxError} {message: Invalid input 'as': expected an expression, 'ORDER BY', 'CALL', 'CREATE', 'LOAD CSV', 'DELETE', 'DETACH', 'FILTER', 'FINISH', 'FOR', 'FOREACH', 'INSERT', 'LET', 'LIMIT', 'MATCH', 'MERGE', 'NEXT', 'NODETACH', 'OFFSET', 'OPTIONAL', 'REMOVE', 'RETURN', 'SEARCH', 'SET', 'SHOW', 'SKIP', 'TERMINATE', 'UNION', 'UNWIND', 'USE', 'WITH' or <EOF> (line 3, column 14 (offset: 31))\r\n\"where p.city as city, avg(p.age) as average_age\"\r\n              ^} {gql_status: 42001} {gql_status_description: error: syntax error or access rule violation - invalid syntax}"
     ]
    }
   ],
   "source": [
    "cypher_query = \"\"\"\n",
    "match (p:Person)\n",
    "where p.city as city, avg(p.age) as average_age\n",
    "with p\n",
    "where average_age > 35\n",
    "return city, average_age\n",
    "order by average_age DESC\n",
    "\"\"\"\n",
    "graph.query(cypher_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "id": "750e75cf",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'name': '홍길동', 'visited_frequency': 2, 'interest_count': 2}]"
      ]
     },
     "execution_count": 36,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher_query = \"\"\"\n",
    "Match (p:Person)\n",
    "Optional Match (p)-[:VISITED]->(l:Location)\n",
    "with p, count(distinct l) as visited_frequency\n",
    "Optional Match (p)-[:LIKES]->(i:Interest)\n",
    "with p, visited_frequency, count(distinct i) as interest_count\n",
    "where visited_frequency >= 2 and interest_count >= 2\n",
    "return p.name as name, visited_frequency, interest_count  \n",
    "\"\"\" \n",
    "graph.query(cypher_query)\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "f06949f1",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "6944bee1",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": ".venv",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.0"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
