{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "24b19d3a",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "True"
      ]
     },
     "execution_count": 1,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import os\n",
    "from dotenv import load_dotenv\n",
    "\n",
    "load_dotenv()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "26545254",
   "metadata": {},
   "outputs": [],
   "source": [
    "from langchain_neo4j import Neo4jGraph\n",
    "\n",
    "graph = Neo4jGraph(\n",
    "    url=os.getenv(\"NEO4J_URI\"),\n",
    "    username=os.getenv(\"NEO4J_USERNAME\"),  \n",
    "    password=os.getenv(\"NEO4J_PASSWORD\"),\n",
    ") "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "db023f46",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "e9db5deb",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'a': {'name': 'Alice', 'age': 30}}]"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher_query = \"\"\"\n",
    "create (a:Person {name: 'Alice', age: 30})\n",
    "return a\n",
    "\"\"\"\n",
    "graph.query(cypher_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "a403263f",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Database reset complete.\n"
     ]
    }
   ],
   "source": [
    "def reset_database(graph):\n",
    "    \"\"\"\n",
    "    reset Database \n",
    "    \"\"\"\n",
    "    graph.query(\"MATCH (n) DETACH DELETE n\")\n",
    "\n",
    "\n",
    "  #delete all constraints\n",
    "    constraints = graph.query(\"SHOW CONSTRAINTS\")\n",
    "    for constraint in constraints:\n",
    "        constraint_name = constraint[\"name\"]\n",
    "        if constraint_name:\n",
    "            graph.query(f\"DROP CONSTRAINT {constraint_name}\")\n",
    "\n",
    "    # delete all indexes\n",
    "    indexes = graph.query(\"SHOW INDEXES\")\n",
    "    for index in indexes:\n",
    "        index_name = index.get(\"name\")\n",
    "        index_type = index.get(\"type\")\n",
    "        if index_name and index_type != \"CONSTRAINT\":\n",
    "            graph.query(f\"DROP INDEX {index_name}\")\n",
    "    \n",
    "    print(\"Database reset complete.\")\n",
    "\n",
    "reset_database(graph)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "aff83ee0",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher_query = \"\"\"\n",
    "CREATE (a:Person {name: 'Alice', age: 30})\n",
    "\"\"\"\n",
    "graph.query(cypher_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "3c0f2c52",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher_query = \"\"\"\n",
    "CREATE (a:Person {name: 'Heide', age: 30})\n",
    "CREATE (b:Person {name: 'Bob', age: 25})\n",
    "CREATE (c:City {name: 'Seoul', population: 9733509})\n",
    "\"\"\"\n",
    "graph.query(cypher_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "659dcf6b",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher_query = \"\"\"\n",
    "MATCH (a:Person {name: 'Alice'}), (b:Person {name: 'Bob'})\n",
    "CREATE (a)-[:KNOWS{since: 2020}]->(b)\n",
    "\"\"\"\n",
    "graph.query(cypher_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "668ec4ba",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'a': {'name': 'Park'}, 'b': {'name': 'Manchester'}}]"
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher_query = \"\"\"\n",
    "CREATE (a:Person {name: 'Park'})-[:LIVES_IN]->(b:City {name: 'Manchester'})\n",
    "return a, b\n",
    "\"\"\"\n",
    "graph.query(cypher_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "36147fb2",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'a': {'name': 'Alice', 'age': 30},\n",
       "  'r': ({'name': 'Alice', 'age': 30},\n",
       "   'LIVES_IN',\n",
       "   {'name': 'Seoul', 'population': 9733509}),\n",
       "  'c': {'name': 'Seoul', 'population': 9733509}}]"
      ]
     },
     "execution_count": 22,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher_query = \"\"\"\n",
    "MATCH (a:Person {name: 'Alice'}),\n",
    "      (c:City {name: 'Seoul'})\n",
    "CREATE (a)-[r:LIVES_IN]->(c)\n",
    "return a,r,c\n",
    "\"\"\"\n",
    "graph.query(cypher_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "id": "3ddcd28a",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'a': {'name': 'Alice', 'age': 30},\n",
       "  'b': {'name': 'Heide', 'age': 30},\n",
       "  'c': {'name': 'Seoul', 'population': 9733509}}]"
      ]
     },
     "execution_count": 25,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher_query = \"\"\"\n",
    "MATCH (a:Person {name: 'Alice'}),\n",
    "(b:Person {name: 'Heide'}),\n",
    "(c:City {name: 'Seoul'})\n",
    "CREATE (a)-[r:LIVES_IN]->(c),\n",
    "        (a)-[r2:KNOWS]->(b),\n",
    "        (a)<-[r3:KNOWS]-(b)\n",
    "return a, b, c\n",
    "\"\"\"\n",
    "graph.query(cypher_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "id": "dbeb9945",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'p': {'name': 'Heide', 'age': 30}}\n",
      "{'p': {'name': 'Alice', 'age': 30}}\n",
      "{'p': {'name': 'Bob', 'age': 25}}\n",
      "{'p': {'name': 'Park'}}\n"
     ]
    }
   ],
   "source": [
    "cypher_query = \"\"\"\n",
    "MATCH (p:Person)\n",
    "\n",
    "return p\n",
    "\"\"\"\n",
    "results = graph.query(cypher_query)\n",
    "for record in results:\n",
    "    print(record)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "id": "ea174bbc",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'name': 'Heide'}\n",
      "{'name': 'Alice'}\n",
      "{'name': 'Bob'}\n",
      "{'name': 'Park'}\n"
     ]
    }
   ],
   "source": [
    "cypher_query = \"\"\"\n",
    "MATCH (p:Person)\n",
    "RETURN p.name AS name\n",
    "\"\"\"\n",
    "results = graph.query(cypher_query)\n",
    "\n",
    "for record in results:\n",
    "    print(record)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "id": "4cb84c4a",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'person': 'Alice', 'city': 'Seoul'},\n",
       " {'person': 'Alice', 'city': 'Seoul'},\n",
       " {'person': 'Alice', 'city': 'Seoul'},\n",
       " {'person': 'Park', 'city': 'Manchester'}]"
      ]
     },
     "execution_count": 31,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher_query = \"\"\"\n",
    "MATCH (p:Person)-[r:LIVES_IN]->(c:City)\n",
    "RETURN p.name AS person, c.name AS city\n",
    "\"\"\"\n",
    "graph.query(cypher_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "id": "a6c0a60a",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'p': {'name': 'Alice', 'age': 30}},\n",
       " {'p': {'name': 'Alice', 'age': 30}},\n",
       " {'p': {'name': 'Alice', 'age': 30}}]"
      ]
     },
     "execution_count": 33,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher_query = \"\"\"\n",
    "MATCH (p:Person)-[r:LIVES_IN]->(c:City)\n",
    "where p.age > 25 and c.name = 'Seoul'\n",
    "RETURN p\n",
    "\"\"\"\n",
    "graph.query(cypher_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "id": "443328c8",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'p': {'name': 'Park', 'age': 44}}]"
      ]
     },
     "execution_count": 34,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher_query = \"\"\"\n",
    "MATCH (p:Person {name:'Park'})\n",
    "\n",
    "SET p.age = 44\n",
    "\n",
    "return p\n",
    "\"\"\"  \n",
    "graph.query(cypher_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "id": "ae72029e",
   "metadata": {},
   "outputs": [
    {
     "ename": "ConstraintError",
     "evalue": "{neo4j_code: Neo.ClientError.Schema.ConstraintValidationFailed} {message: Cannot delete node<1>, because it still has relationships. To delete this node, you must first delete its relationships.} {gql_status: G1001} {gql_status_description: error: dependent object error - edges still exist}",
     "output_type": "error",
     "traceback": [
      "\u001b[31m---------------------------------------------------------------------------\u001b[39m",
      "\u001b[31mConstraintError\u001b[39m                           Traceback (most recent call last)",
      "\u001b[36mCell\u001b[39m\u001b[36m \u001b[39m\u001b[32mIn[35]\u001b[39m\u001b[32m, line 5\u001b[39m\n\u001b[32m      1\u001b[39m cypher_query = \"\"\"\n\u001b[32m      2\u001b[39m MATCH (p:Person {name: \u001b[33m'Alice'\u001b[39m})\n\u001b[32m      3\u001b[39m DELETE p\n\u001b[32m      4\u001b[39m \"\"\"\n\u001b[32m----> \u001b[39m\u001b[32m5\u001b[39m graph.query(cypher_query)\n",
      "\u001b[36mFile \u001b[39m\u001b[32mc:\\Users\\user\\neo4j-SicPama\\.venv\\Lib\\site-packages\\langchain_neo4j\\graphs\\neo4j_graph.py:245\u001b[39m, in \u001b[36mNeo4jGraph.query\u001b[39m\u001b[34m(self, query, params, session_params)\u001b[39m\n\u001b[32m    243\u001b[39m \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;129;01mnot\u001b[39;00m session_params:\n\u001b[32m    244\u001b[39m     \u001b[38;5;28;01mtry\u001b[39;00m:\n\u001b[32m--> \u001b[39m\u001b[32m245\u001b[39m         data, _, _ = \u001b[30;43mself\u001b[39;49m\u001b[30;43m.\u001b[39;49m\u001b[30;43m_driver\u001b[39;49m\u001b[30;43m.\u001b[39;49m\u001b[30;43mexecute_query\u001b[39;49m\u001b[30;43m(\u001b[39;49m\n\u001b[32m    246\u001b[39m \u001b[30;43m            \u001b[39;49m\u001b[30;43mQuery\u001b[39;49m\u001b[30;43m(\u001b[39;49m\u001b[30;43mtext\u001b[39;49m\u001b[30;43m=\u001b[39;49m\u001b[30;43mquery\u001b[39;49m\u001b[30;43m,\u001b[39;49m\u001b[30;43m \u001b[39;49m\u001b[30;43mtimeout\u001b[39;49m\u001b[30;43m=\u001b[39;49m\u001b[30;43mself\u001b[39;49m\u001b[30;43m.\u001b[39;49m\u001b[30;43mtimeout\u001b[39;49m\u001b[30;43m)\u001b[39;49m\u001b[30;43m,\u001b[39;49m\n\u001b[32m    247\u001b[39m \u001b[30;43m            \u001b[39;49m\u001b[30;43mdatabase_\u001b[39;49m\u001b[30;43m=\u001b[39;49m\u001b[30;43mself\u001b[39;49m\u001b[30;43m.\u001b[39;49m\u001b[30;43m_database\u001b[39;49m\u001b[30;43m,\u001b[39;49m\n\u001b[32m    248\u001b[39m \u001b[30;43m            \u001b[39;49m\u001b[30;43mparameters_\u001b[39;49m\u001b[30;43m=\u001b[39;49m\u001b[30;43mparams\u001b[39;49m\u001b[30;43m,\u001b[39;49m\n\u001b[32m    249\u001b[39m \u001b[30;43m        \u001b[39;49m\u001b[30;43m)\u001b[39;49m\n\u001b[32m    250\u001b[39m         json_data = [r.data() \u001b[38;5;28;01mfor\u001b[39;00m r \u001b[38;5;129;01min\u001b[39;00m data]\n\u001b[32m    251\u001b[39m         \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;28mself\u001b[39m.sanitize:\n",
      "\u001b[36mFile \u001b[39m\u001b[32mc:\\Users\\user\\neo4j-SicPama\\.venv\\Lib\\site-packages\\neo4j\\_sync\\driver.py:950\u001b[39m, in \u001b[36mDriver.execute_query\u001b[39m\u001b[34m(self, query_, parameters_, routing_, database_, impersonated_user_, bookmark_manager_, auth_, result_transformer_, **kwargs)\u001b[39m\n\u001b[32m    946\u001b[39m     \u001b[38;5;28;01mraise\u001b[39;00m \u001b[38;5;167;01mValueError\u001b[39;00m(\n\u001b[32m    947\u001b[39m         \u001b[33mf\u001b[39m\u001b[33m\"\u001b[39m\u001b[33mInvalid routing control value: \u001b[39m\u001b[38;5;132;01m{\u001b[39;00mrouting_\u001b[38;5;132;01m!r}\u001b[39;00m\u001b[33m\"\u001b[39m\n\u001b[32m    948\u001b[39m     )\n\u001b[32m    949\u001b[39m \u001b[38;5;28;01mwith\u001b[39;00m session._pipelined_begin:\n\u001b[32m--> \u001b[39m\u001b[32m950\u001b[39m     \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[30;43msession\u001b[39;49m\u001b[30;43m.\u001b[39;49m\u001b[30;43m_run_transaction\u001b[39;49m\u001b[30;43m(\u001b[39;49m\n\u001b[32m    951\u001b[39m \u001b[30;43m        \u001b[39;49m\u001b[30;43maccess_mode\u001b[39;49m\u001b[30;43m,\u001b[39;49m\n\u001b[32m    952\u001b[39m \u001b[30;43m        \u001b[39;49m\u001b[30;43mTelemetryAPI\u001b[39;49m\u001b[30;43m.\u001b[39;49m\u001b[30;43mDRIVER\u001b[39;49m\u001b[30;43m,\u001b[39;49m\n\u001b[32m    953\u001b[39m \u001b[30;43m        \u001b[39;49m\u001b[30;43mwork\u001b[39;49m\u001b[30;43m,\u001b[39;49m\n\u001b[32m    954\u001b[39m \u001b[30;43m        \u001b[39;49m\u001b[30;43m(\u001b[39;49m\u001b[30;43mquery_str\u001b[39;49m\u001b[30;43m,\u001b[39;49m\u001b[30;43m \u001b[39;49m\u001b[30;43mparameters\u001b[39;49m\u001b[30;43m,\u001b[39;49m\u001b[30;43m \u001b[39;49m\u001b[30;43mresult_transformer_\u001b[39;49m\u001b[30;43m)\u001b[39;49m\u001b[30;43m,\u001b[39;49m\n\u001b[32m    955\u001b[39m \u001b[30;43m        \u001b[39;49m\u001b[30;43m{\u001b[39;49m\u001b[30;43m}\u001b[39;49m\u001b[30;43m,\u001b[39;49m\n\u001b[32m    956\u001b[39m \u001b[30;43m    \u001b[39;49m\u001b[30;43m)\u001b[39;49m\n",
      "\u001b[36mFile \u001b[39m\u001b[32mc:\\Users\\user\\neo4j-SicPama\\.venv\\Lib\\site-packages\\neo4j\\_sync\\work\\session.py:589\u001b[39m, in \u001b[36mSession._run_transaction\u001b[39m\u001b[34m(self, access_mode, api, transaction_function, args, kwargs)\u001b[39m\n\u001b[32m    587\u001b[39m         \u001b[38;5;28;01mraise\u001b[39;00m\n\u001b[32m    588\u001b[39m     \u001b[38;5;28;01melse\u001b[39;00m:\n\u001b[32m--> \u001b[39m\u001b[32m589\u001b[39m         \u001b[30;43mtx\u001b[39;49m\u001b[30;43m.\u001b[39;49m\u001b[30;43m_commit\u001b[39;49m\u001b[30;43m(\u001b[39;49m\u001b[30;43m)\u001b[39;49m\n\u001b[32m    590\u001b[39m \u001b[38;5;28;01mexcept\u001b[39;00m (DriverError, Neo4jError) \u001b[38;5;28;01mas\u001b[39;00m error:\n\u001b[32m    591\u001b[39m     \u001b[38;5;28mself\u001b[39m._disconnect()\n",
      "\u001b[36mFile \u001b[39m\u001b[32mc:\\Users\\user\\neo4j-SicPama\\.venv\\Lib\\site-packages\\neo4j\\_sync\\work\\transaction.py:220\u001b[39m, in \u001b[36mTransactionBase._commit\u001b[39m\u001b[34m(self)\u001b[39m\n\u001b[32m    218\u001b[39m \u001b[38;5;28mself\u001b[39m._connection.commit(on_success=metadata.update)\n\u001b[32m    219\u001b[39m \u001b[38;5;28mself\u001b[39m._connection.send_all()\n\u001b[32m--> \u001b[39m\u001b[32m220\u001b[39m \u001b[30;43mself\u001b[39;49m\u001b[30;43m.\u001b[39;49m\u001b[30;43m_connection\u001b[39;49m\u001b[30;43m.\u001b[39;49m\u001b[30;43mfetch_all\u001b[39;49m\u001b[30;43m(\u001b[39;49m\u001b[30;43m)\u001b[39;49m\n\u001b[32m    221\u001b[39m \u001b[38;5;28mself\u001b[39m._bookmark = metadata.get(\u001b[33m\"\u001b[39m\u001b[33mbookmark\u001b[39m\u001b[33m\"\u001b[39m)\n\u001b[32m    222\u001b[39m \u001b[38;5;28mself\u001b[39m._database = metadata.get(\u001b[33m\"\u001b[39m\u001b[33mdb\u001b[39m\u001b[33m\"\u001b[39m, \u001b[38;5;28mself\u001b[39m._database)\n",
      "\u001b[36mFile \u001b[39m\u001b[32mc:\\Users\\user\\neo4j-SicPama\\.venv\\Lib\\site-packages\\neo4j\\_sync\\io\\_bolt.py:883\u001b[39m, in \u001b[36mBolt.fetch_all\u001b[39m\u001b[34m(self)\u001b[39m\n\u001b[32m    881\u001b[39m response = \u001b[38;5;28mself\u001b[39m.responses[\u001b[32m0\u001b[39m]\n\u001b[32m    882\u001b[39m \u001b[38;5;28;01mwhile\u001b[39;00m \u001b[38;5;129;01mnot\u001b[39;00m response.complete:\n\u001b[32m--> \u001b[39m\u001b[32m883\u001b[39m     detail_delta, summary_delta = \u001b[30;43mself\u001b[39;49m\u001b[30;43m.\u001b[39;49m\u001b[30;43mfetch_message\u001b[39;49m\u001b[30;43m(\u001b[39;49m\u001b[30;43m)\u001b[39;49m\n\u001b[32m    884\u001b[39m     detail_count += detail_delta\n\u001b[32m    885\u001b[39m     summary_count += summary_delta\n",
      "\u001b[36mFile \u001b[39m\u001b[32mc:\\Users\\user\\neo4j-SicPama\\.venv\\Lib\\site-packages\\neo4j\\_sync\\io\\_bolt.py:868\u001b[39m, in \u001b[36mBolt.fetch_message\u001b[39m\u001b[34m(self)\u001b[39m\n\u001b[32m    864\u001b[39m \u001b[38;5;66;03m# Receive exactly one message\u001b[39;00m\n\u001b[32m    865\u001b[39m tag, fields = \u001b[38;5;28mself\u001b[39m.inbox.pop(\n\u001b[32m    866\u001b[39m     hydration_hooks=\u001b[38;5;28mself\u001b[39m.responses[\u001b[32m0\u001b[39m].hydration_hooks\n\u001b[32m    867\u001b[39m )\n\u001b[32m--> \u001b[39m\u001b[32m868\u001b[39m res = \u001b[30;43mself\u001b[39;49m\u001b[30;43m.\u001b[39;49m\u001b[30;43m_process_message\u001b[39;49m\u001b[30;43m(\u001b[39;49m\u001b[30;43mtag\u001b[39;49m\u001b[30;43m,\u001b[39;49m\u001b[30;43m \u001b[39;49m\u001b[30;43mfields\u001b[39;49m\u001b[30;43m)\u001b[39;49m\n\u001b[32m    869\u001b[39m \u001b[38;5;28mself\u001b[39m.idle_since = monotonic()\n\u001b[32m    870\u001b[39m \u001b[38;5;28;01mreturn\u001b[39;00m res\n",
      "\u001b[36mFile \u001b[39m\u001b[32mc:\\Users\\user\\neo4j-SicPama\\.venv\\Lib\\site-packages\\neo4j\\_sync\\io\\_bolt6.py:548\u001b[39m, in \u001b[36mBolt6x0._process_message\u001b[39m\u001b[34m(self, tag, fields)\u001b[39m\n\u001b[32m    546\u001b[39m \u001b[38;5;28mself\u001b[39m._enrich_error_diagnostic_record(summary_metadata)\n\u001b[32m    547\u001b[39m \u001b[38;5;28;01mtry\u001b[39;00m:\n\u001b[32m--> \u001b[39m\u001b[32m548\u001b[39m     \u001b[30;43mresponse\u001b[39;49m\u001b[30;43m.\u001b[39;49m\u001b[30;43mon_failure\u001b[39;49m\u001b[30;43m(\u001b[39;49m\u001b[30;43msummary_metadata\u001b[39;49m\u001b[30;43m \u001b[39;49m\u001b[30;43;01mor\u001b[39;49;00m\u001b[30;43m \u001b[39;49m\u001b[30;43m{\u001b[39;49m\u001b[30;43m}\u001b[39;49m\u001b[30;43m)\u001b[39;49m\n\u001b[32m    549\u001b[39m \u001b[38;5;28;01mexcept\u001b[39;00m (ServiceUnavailable, DatabaseUnavailable):\n\u001b[32m    550\u001b[39m     \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;28mself\u001b[39m.pool:\n",
      "\u001b[36mFile \u001b[39m\u001b[32mc:\\Users\\user\\neo4j-SicPama\\.venv\\Lib\\site-packages\\neo4j\\_sync\\io\\_common.py:263\u001b[39m, in \u001b[36mResponse.on_failure\u001b[39m\u001b[34m(self, metadata)\u001b[39m\n\u001b[32m    261\u001b[39m handler = \u001b[38;5;28mself\u001b[39m.handlers.get(\u001b[33m\"\u001b[39m\u001b[33mon_summary\u001b[39m\u001b[33m\"\u001b[39m)\n\u001b[32m    262\u001b[39m Util.callback(handler)\n\u001b[32m--> \u001b[39m\u001b[32m263\u001b[39m \u001b[38;5;28;01mraise\u001b[39;00m \u001b[38;5;28mself\u001b[39m._hydrate_error(metadata)\n",
      "\u001b[31mConstraintError\u001b[39m: {neo4j_code: Neo.ClientError.Schema.ConstraintValidationFailed} {message: Cannot delete node<1>, because it still has relationships. To delete this node, you must first delete its relationships.} {gql_status: G1001} {gql_status_description: error: dependent object error - edges still exist}"
     ]
    }
   ],
   "source": [
    "cypher_query = \"\"\"\n",
    "MATCH (p:Person {name: 'Alice'})\n",
    "DELETE p\n",
    "\"\"\"\n",
    "graph.query(cypher_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "id": "ab174674",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 36,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher_query = \"\"\"\n",
    "MATCH (p:Person {name: 'Alice'})\n",
    "DETACH DELETE p\n",
    "\"\"\"\n",
    "graph.query(cypher_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "id": "3d808278",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'p': {'name': 'Park', 'age': 44}, 'c': {'name': 'Manchester'}}]"
      ]
     },
     "execution_count": 37,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher_query = \"\"\"\n",
    "MATCH (p:Person{name:\"Park\"})-[r:LIVES_IN]->(c:City)\n",
    "DELETE r\n",
    "RETURN p, c\n",
    "\"\"\"\n",
    "graph.query(cypher_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "id": "74791e22",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'p': {'name': 'Park'}}]"
      ]
     },
     "execution_count": 38,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher_query = \"\"\"\n",
    "MATCH (p:Person{name:\"Park\"})\n",
    "REMOVE p.age\n",
    "RETURN p\n",
    "\"\"\"\n",
    "graph.query(cypher_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 41,
   "id": "5fb1cf9d",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 41,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher_query = \"\"\"\n",
    "MATCH (p:Person {name:'Bob'})\n",
    "REMOVE p:Person\n",
    "\n",
    "\"\"\"\n",
    "graph.query(cypher_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 45,
   "id": "4e43e3bf",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'p': {'name': 'Bob', 'age': 25}}]"
      ]
     },
     "execution_count": 45,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher_query = \"\"\"\n",
    "MATCH (p {name: \"Bob\"})\n",
    "SET p:Person, p.age = 25\n",
    "ReTURN p\n",
    "\"\"\"\n",
    "graph.query(cypher_query)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 46,
   "id": "0f43939a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'p': {'name': 'Bob', 'age': 25}}\n",
      "{'p': {'name': 'Heide', 'age': 30}}\n"
     ]
    }
   ],
   "source": [
    "cypher_query = \"\"\"\n",
    "MATCH (p:Person)\n",
    "RETURN p\n",
    "ORDER BY p.age\n",
    "lIMIT 2 \n",
    "\"\"\"\n",
    "result = graph.query(cypher_query)\n",
    "for record in result:\n",
    "    print(record)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 47,
   "id": "599beb88",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'p': {'name': 'Heide', 'age': 30}}\n"
     ]
    }
   ],
   "source": [
    "cypher_query = \"\"\"\n",
    "MATCH (p:Person)\n",
    "RETURN p\n",
    "ORDER BY p.age\n",
    "skip 1\n",
    "lIMIT 1 \n",
    "\"\"\"\n",
    "result = graph.query(cypher_query)\n",
    "for record in result:\n",
    "    print(record)\n"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": ".venv",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.0"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
